# 파이썬에서 SQL DB 접속하기

In [1]:
import pymysql

con = pymysql.connect(
    user='root',
    passwd='04250629',
    host='192.168.219.106',
    db='shop',
    charset='utf8'
)

mycursor = con.cursor()

In [2]:
# 실행하고자 하는 쿼리를 입력
query = """
SELECT * FROM goods;
"""

# execute() 메서드를 사용해서 쿼리를 데이터베이스 서버에 보냄
mycursor.execute(query)

# fetchall(), fetchone(), fetchmany() 등의 메서드를 사용하여 서버에서 데이터를 가져옴
## fetchall(): 테이블 안의 모든 데이터 추출
## fetchone(): 테이블 안의 데이터를 한 행씩 추출
## fetchmany(): 테이블 안의 데이터 중 n개의 행을 추출
data = mycursor.fetchall()

# 원하는 작업을 마친 후에는 반드시 close() 메서드를 통해 데이터베이스와의 연결 종료
con.close()

display(data)

(('0001', '티셔츠', '의류', 1000, 500, datetime.date(2020, 9, 20)),
 ('0002', '펀칭기', '사무용품', 500, 320, datetime.date(2020, 9, 11)),
 ('0003', '와이셔츠', '의류', 4000, 2800, datetime.date(2020, 9, 1)),
 ('0004', '식칼', '주방용품', 3000, 2800, datetime.date(2020, 9, 20)),
 ('0005', '압력솥', '주방용품', 6800, 5000, datetime.date(2020, 1, 25)),
 ('0006', '포크', '주방용품', 500, 300, datetime.date(2020, 9, 20)),
 ('0007', '도마', '주방용품', 800, 790, datetime.date(2020, 4, 28)),
 ('0008', '볼펜', '사무용품', 100, 80, datetime.date(2020, 11, 11)),
 ('0009', '스테이플러', '사무용품', 2000, 1500, datetime.date(2020, 12, 30)))

In [3]:
# 데이터 입력 수정
# con = pymysql.connect(
#     user='root',
#     passwd='04250629',
#     host='192.168.219.106',
#     db='shop',
#     charset='utf8'
# )

# mycursor = con.cursor()

# query = """ 
# INSERT INTO goods (goods_id, goods_name, goods_classify, sell_price, buy_price, register_date) 
# VALUES ('0009', '스테이플러', '사무용품', '2000', '1500', '2020-12-30');
# """

# mycursor.execute(query)

# # DML 문장을 실행하는 경우, commit() 메서드를 사용하여 데이터의 확장 갱신 작업 추가
# con.commit()
# con.close()

# Pandas with Database

In [5]:
import pandas as pd
# pandas에서 SQL에 연결할 때는 ORM(object relational mapping)을 사용
# ORM이란 응용 프로그램과 데이터베이스를 연결할 때 SQL언어가 아닌 응용 프로그램 언어로 데이터베이스를 접근할 수 있게 해주는 툴
from sqlalchemy import create_engine

In [9]:
user = 'root'
pw = '04250629'
host='192.168.219.106'
port='3306'
db='shop'
# engine = create_engine('mysql+pymysql://[user_name]:[password]@[host:port]/[database])
print(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{db}')
engine = create_engine(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{db}')
query = """SELECT * FROM goods"""
goods = pd.read_sql(query, con=engine)      # 쿼리 작성 후 read_sql() 함수에 입력
engine.dispose()                            # engine.dispose()를 통해 연결을 종료

goods.head()

mysql+pymysql://root:04250629@192.168.219.106:3306/shop

  goods_id goods_name goods_classify  sell_price  buy_price register_date
0     0001        티셔츠             의류        1000        500    2020-09-20
1     0002        펀칭기           사무용품         500        320    2020-09-11
2     0003       와이셔츠             의류        4000       2800    2020-09-01
3     0004         식칼           주방용품        3000       2800    2020-09-20
4     0005        압력솥           주방용품        6800       5000    2020-01-25

In [10]:
# 데이터프레임을 SQL 데이터베이스에 저장
import seaborn as sns
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [11]:
from sqlalchemy import create_engine

engine = create_engine(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{db}')
# df.to_sql()을 통해 데이터프레임을 데이터베이스에 저장 가능
# 테이블 이름은 'iris', con에는 위에서 생성한 엔진 입력
# index=False를 통해 인덱스는 생성하지 않음
# if_exists = 'replace'를 입력하면 해당 테이블이 존재할 시 데이터를 덮어쓴다.
iris.to_sql(name = 'iris', con=engine, index=False, if_exists='replace')
engine.dispose()

# upsert 기능 구현하기

In [13]:
# exam 데이터베이스 생성
from sqlalchemy_utils import create_database

new_db_name = 'exam'

create_database(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{new_db_name}')

In [16]:
# create sample timeseires data
price = pd.DataFrame({
    'date': ['2021-01-02', '2021-01-03'],
    'ticker': ['000001', '000001'],
    'close': [1340, 1315],
    'volume': [1000, 2000]
})

price.head()

         date  ticker  close  volume
0  2021-01-02  000001   1340    1000
1  2021-01-03  000001   1315    2000

In [17]:
# insert data into database
engine = create_engine(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{new_db_name}')
price.to_sql('price', con=engine, if_exists='append', index=False)
engine.dispose()

In [18]:
# new timeseries data
new = pd.DataFrame({
    "date" : ['2021-01-04'],
    "ticker": ['000001'],
    "close": [1320],
    "volume": [1500]
})
price = pd.concat([price, new])
price.head()

         date  ticker  close  volume
0  2021-01-02  000001   1340    1000
1  2021-01-03  000001   1315    2000
0  2021-01-04  000001   1320    1500

In [19]:
engine = create_engine(f'mysql+pymysql://{user}:{pw}@{host}:{port}/{new_db_name}')
price.to_sql('price', con=engine, if_exists="append", index=False)
engine.dispose()

## MySQL에서 upsert 기능 구현하기

In [22]:
import pymysql

con = pymysql.connect(
    user='root',
    passwd='04250629',
    host='192.168.219.106',
    db='exam',
    charset='utf8'
)

mycursor = con.cursor()

In [23]:
sql = """ 
CREATE TABLE price_2(
    date VARCHAR(10),
    ticker VARCHAR(6),
    close INT,
    volume INT,
    PRIMARY KEY(date, ticker)
)
"""

mycursor.execute(sql)
data = mycursor.fetchall()
con.commit()
con.close()

In [24]:
con = pymysql.connect(
    user='root',
    passwd='04250629',
    host='192.168.219.106',
    db='exam',
    charset='utf8'
)

mycursor = con.cursor()

In [25]:
sql = """ 
INSERT INTO price_2 (date, ticker, close, volume)
VALUES 
('2021-01-02', '000001', 1340, 1000),
('2021-01-03', '000001', 1315, 2000),
('2021-01-02', '000002', 500, 200)
"""

mycursor.execute(sql)
con.commit()

In [30]:
sql_book = """ 
INSERT INTO price_2 (date, ticker, close, volume)
VALUES
('2021-01-02', '000001', 1340, 1000),
('2021-01-03', '000001', 1315, 2000),
('2021-01-02', '000002', 500, 200),
('2021-01-03', '000002', 1380, 3000)
AS new
ON DUPLICATE KEY UPDATE
close = new.close, volume = new.volume;
"""

sql_adjusted = """ 
INSERT INTO price_2 (date, ticker, close, volume)
VALUES
('2021-01-02', '000001', 1340, 1000),
('2021-01-03', '000001', 1315, 2000),
('2021-01-02', '000002', 500, 200),
('2021-01-03', '000002', 1380, 3000)
ON DUPLICATE KEY UPDATE
close = VALUES(close), volume = VALUES(volume);
"""

mycursor.execute(sql_adjusted)
con.commit()

In [31]:
sql = """ 
INSERT INTO price_2 (date, ticker, close, volume)
VALUES
('2021-01-02', '000001', 1300, 1100),
('2021-01-04', '000001', 1300, 2000)
ON DUPLICATE KEY UPDATE
close = VALUES(close), volume = VALUES(volume)
"""
mycursor.execute(sql)
con.commit()
con.close()

## 파이썬에서 upsert 기능 구현

In [32]:
price = pd.DataFrame({
    'date': ['2021-01-04', '2021-01-04'],
    'ticker': ['000001', '000002'],
    'close': [1320, 1315],
    'volume': [2100, 1500]
})

args = price.values.tolist()
args

[['2021-01-04', '000001', 1320, 2100], ['2021-01-04', '000002', 1315, 1500]]

In [33]:
con = pymysql.connect(
    user='root',
    passwd='04250629',
    host='192.168.219.106',
    db='exam',
    charset='utf8'
)

mycursor = con.cursor()

query = """ 
INSERT INTO price_2 (date, ticker, close, volume)
VALUES (%s, %s, %s, %s)
ON DUPLICATE KEY UPDATE
close = VALUES(close), volume = VALUES(volume);
"""

mycursor.executemany(query, args)
con.commit()

con.close()

In [35]:
con = pymysql.connect(
    user='root',
    passwd='04250629',
    host='192.168.219.106',
    db='exam',
    charset='utf8'
)

mycursor = con.cursor()

query = """DROP DATABASE exam;"""

mycursor.execute(query)
con.commit()

con.close()